infra-bench/jobs/opencode-qwopus3.6-35b-a3b-coder-onprem/sglang-sync-stall__g56jWYZ/verifier/vprofile.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=9080, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='/models/Qwen3.5-0.8B', served_model_name=None, tokenizer=None, num_prompts=4, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=5, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://0.0.0.0:9080/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=9080, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='/models/Qwen3.5-0.8B', served_model_name=None, tokenizer=None, num_prompts=4, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=5, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 16384
#Output tokens: 20
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Starting profiler...
async_request_profile api_url='http://0.0.0.0:9080/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None, 'output_dir': '/tmp/verifier-sgl-profile/1784524984.1249413', 'profile_prefix': None}
Profiler started
100%|██████████| 4/4 [00:05<00:00,  1.33s/it]
Stopping profiler...
async_request_profile api_url='http://0.0.0.0:9080/stop_profile' body={}
Profiler stopped

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     4         
Benchmark duration (s):                  5.32      
Total input tokens:                      16384     
Total input text tokens:                 16384     
Total generated tokens:                  20        
Total generated tokens (retokenized):    20        
Request throughput (req/s):              0.75      
Input token throughput (tok/s):          3079.24   
Output token throughput (tok/s):         3.76      
Peak output token throughput (tok/s):    20.00     
Peak concurrent requests:                4         
Total token throughput (tok/s):          3083.00   
Concurrency:                             0.04      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   55.29     
Median E2E Latency (ms):                 55.43     
P90 E2E Latency (ms):                    58.27     
P99 E2E Latency (ms):                    59.08     
---------------Time to First Token----------------
Mean TTFT (ms):                          45.74     
Median TTFT (ms):                        45.96     
P99 TTFT (ms):                           49.50     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2.39      
Median TPOT (ms):                        2.39      
P99 TPOT (ms):                           2.42      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           2.39      
Median ITL (ms):                         2.59      
P95 ITL (ms):                            2.79      
P99 ITL (ms):                            2.79      
Max ITL (ms):                            2.79      
==================================================